In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

yt_df = pd.read_csv("data/interim/yt_with_less_col_2020_01.csv")
yt_df.head()

,Unnamed: 0,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
0,0,1577838495,1577838783,1.0,1.2,238,239,1,6.0,2.5
1,1,1577838939,1577839384,1.0,1.2,239,238,1,7.0,2.5
2,2,1577839661,1577840032,1.0,0.6,238,238,1,6.0,2.5
3,3,1577840123,1577840414,1.0,0.8,238,151,1,5.5,0.0
4,4,1577836918,1577837056,1.0,0.0,193,193,2,3.5,0.0

In [3]:
districts_df = pd.read_csv("data/raw/nyc_zone_lookup.csv")
districts_df.head()

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [5]:
# Lets merge df
yt_df["PULocationID"] = yt_df["PULocationID"].apply(lambda x: districts_df.loc[x-1]["Borough"]).astype("object")

In [6]:
yt_df["DOLocationID"] = yt_df["DOLocationID"].apply(lambda x: districts_df.loc[x-1]["Borough"]).astype("object")

In [8]:
yt_districts_df = yt_df.to_csv("data/interim/yt_with_less_col_and_join_with_districts_2020_01.csv")

In [9]:
yt_districts_df = pd.read_csv("data/interim/yt_with_less_col_and_join_with_districts_2020_01.csv")
yt_districts_df.head()

,Unnamed: 0.1,Unnamed: 0,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,PULocationID,DOLocationID,payment_type,fare_amount,congestion_surcharge
0,0,0,1577838495,1577838783,1.0,1.2,Manhattan,Manhattan,1,6.0,2.5
1,1,1,1577838939,1577839384,1.0,1.2,Manhattan,Manhattan,1,7.0,2.5
2,2,2,1577839661,1577840032,1.0,0.6,Manhattan,Manhattan,1,6.0,2.5
3,3,3,1577840123,1577840414,1.0,0.8,Manhattan,Manhattan,1,5.5,0.0
4,4,4,1577836918,1577837056,1.0,0.0,Queens,Queens,2,3.5,0.0